cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

brew 'readline'
brew 'bash'
brew 'coreutils'
brew 'gnu-sed'
brew 'pkg-config'
brew 'openssl'
brew 'libevent'
brew 'gettext'
brew 'libpng'
brew 's-lang'
brew 'newt', args: ['with-python']
brew 'byobu'
brew 'findutils'
brew 'gdbm'
brew 'gotags'
brew 'httpie'
brew 'icdiff'
brew 'leiningen'
brew 'macvim', args: ['with-override-system-vim']
brew 'node'
brew 'tree'
brew 'unrar'
brew 'zsh'
brew 'the_silver_searcher'
brew 'homebrew/dupes/grep'

cask 'adobe-reader'
cask 'alfred'
cask 'anki'
cask 'atom'
cask 'ccmenu'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text3'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'toggldesktop'
cask 'utorrent'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
